package com.horstmann.impatient.chap01;

/**
 * Напишите программу, выводящую наименьшее и наибольшее положительное
 * значения типа double. Подсказка: воспользуйтесь методом Math.nextUp()
 * из прикладного программного интерфейса Java API
 */
public class Task4 {
  public static void main(String[] args) {
    System.out.println(Double.MAX_VALUE);
    System.out.println(Double.MIN_VALUE);
  }
}
